# Задание 1
def calculation(n):
    return (n * (n + 1))/2


n = int(input(f'Введите число:'))
print(f'Сумма чисел равняется {calculation(n)}')
